Revit 2024 API
ConduitSize Class
 Stores the basic size information for a conduit.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public class ConduitSize : IDisposable
Visual Basic
Public Class ConduitSize _
	Implements IDisposable
Visual C++
public ref class ConduitSize : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Electrical.ConduitSize
See Also
ConduitSize Members
Autodesk.Revit.DB.Electrical Namespace